<details ><summary>plan for talos-bootstrap 2025-07-19 21:44:54 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #72
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"] will be destroyed
  # (because key ["atuan"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "atuan" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["controlplane"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "havnor"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["controlplane-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "selidor"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["controlplane-3"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "gont"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["gont"] will be destroyed
  # (because key ["gont"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "gont" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"] will be destroyed
  # (because key ["havnor"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "havnor" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["selidor"] will be destroyed
  # (because key ["selidor"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "selidor" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["worker-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "atuan"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["worker-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "atuan"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.50",
            ],
          - [],
          - [
              - "10.244.2.221",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe7c:cce6",
            ],
          - [
              - "fe80::8cc6:b2ff:fe3d:9515",
            ],
          - [
              - "fe80::3057:8fff:fe26:a275",
            ],
          - [
              - "fe80::8eb:50ff:fec4:8115",
            ],
          - [
              - "fe80::b804:a6ff:feb5:4071",
            ],
          - [
              - "fe80::1ce5:dbff:fec5:b9b",
            ],
          - [
              - "fe80::3c49:86ff:fefb:163b",
            ],
          - [
              - "fe80::f8de:d9ff:fea6:80bc",
            ],
          - [
              - "fe80::60a5:9aff:fe9f:5356",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "C6:13:BB:8D:1E:39",
          - "9E:D4:BE:34:E2:AD",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:7C:CC:E6",
          - "8E:C6:B2:3D:95:15",
          - "32:57:8F:26:A2:75",
          - "0A:EB:50:C4:81:15",
          - "BA:04:A6:B5:40:71",
          - "1E:E5:DB:C5:0B:9B",
          - "3E:49:86:FB:16:3B",
          - "FA:DE:D9:A6:80:BC",
          - "62:A5:9A:9F:53:56",
        ] -> (known after apply)
        name                    = "talos-controlplane"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxcc87902087084",
          - "lxc862afe21551a",
          - "lxc7ff4a5c05d4d",
          - "lxc7b9d5530d79a",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 100 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-100-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:7C:CC:E6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-2"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "104" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.53",
            ],
          - [],
          - [
              - "10.244.4.70",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:feaf:4c4e",
            ],
          - [
              - "fe80::d8e2:9bff:fe33:cb1b",
            ],
          - [
              - "fe80::3cc6:feff:fe70:c669",
            ],
          - [
              - "fe80::9086:75ff:fe7a:1f26",
            ],
          - [
              - "fe80::8408:6bff:fe22:58c",
            ],
          - [
              - "fe80::b007:dbff:fef9:ec0",
            ],
          - [
              - "fe80::209b:3fff:fe6d:7370",
            ],
          - [
              - "fe80::8f8:ebff:fec9:34cc",
            ],
          - [
              - "fe80::ccd9:b5ff:fe13:33f",
            ],
          - [
              - "fe80::4ae:d7ff:fe61:99cd",
            ],
          - [
              - "fe80::f85f:67ff:fe4e:6c92",
            ],
          - [
              - "fe80::e48f:eaff:fe0f:1815",
            ],
          - [
              - "fe80::84d3:a6ff:feba:281d",
            ],
          - [
              - "fe80::8407:98ff:fec7:4cff",
            ],
          - [
              - "fe80::1cfa:d9ff:fe13:e37f",
            ],
          - [
              - "fe80::ccb7:6cff:fe71:3f68",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "CA:21:24:FF:8D:F9",
          - "2A:6B:62:5D:A9:D0",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:AF:4C:4E",
          - "DA:E2:9B:33:CB:1B",
          - "3E:C6:FE:70:C6:69",
          - "92:86:75:7A:1F:26",
          - "86:08:6B:22:05:8C",
          - "B2:07:DB:F9:0E:C0",
          - "22:9B:3F:6D:73:70",
          - "0A:F8:EB:C9:34:CC",
          - "CE:D9:B5:13:03:3F",
          - "06:AE:D7:61:99:CD",
          - "FA:5F:67:4E:6C:92",
          - "E6:8F:EA:0F:18:15",
          - "86:D3:A6:BA:28:1D",
          - "86:07:98:C7:4C:FF",
          - "1E:FA:D9:13:E3:7F",
          - "CE:B7:6C:71:3F:68",
        ] -> (known after apply)
        name                    = "talos-controlplane-2"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxccb318112fa91",
          - "lxc99f968452215",
          - "lxcb8cefcfd5c11",
          - "lxcab13fc11ef64",
          - "lxc4c10b78f8fac",
          - "lxca21e86f4b3e6",
          - "lxc765d4fbd5f55",
          - "lxc4787ce2f737b",
          - "lxc13791655561a",
          - "lxccbea793e77c6",
          - "lxc3052476afcd4",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 104 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-104-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:AF:4C:4E" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-3"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "103" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.54",
            ],
          - [],
          - [
              - "10.244.3.141",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed5:a6",
            ],
          - [
              - "fe80::f41b:18ff:fe6a:baa5",
            ],
          - [
              - "fe80::3ca3:57ff:fee0:2bea",
            ],
          - [
              - "fe80::104d:c1ff:feca:a461",
            ],
          - [
              - "fe80::8066:c2ff:fe68:5ab8",
            ],
          - [
              - "fe80::b442:5fff:fe61:3399",
            ],
          - [
              - "fe80::5c31:28ff:feb2:16c3",
            ],
          - [
              - "fe80::20c7:c6ff:fe96:1a6c",
            ],
          - [
              - "fe80::b0d1:2fff:fea0:8428",
            ],
          - [
              - "fe80::e844:67ff:feb2:645",
            ],
          - [
              - "fe80::4010:2cff:feef:ac26",
            ],
          - [
              - "fe80::8ec:24ff:fead:cc5c",
            ],
          - [
              - "fe80::c8ba:71ff:fe65:c05b",
            ],
          - [
              - "fe80::b45f:ffff:fe50:d2f0",
            ],
          - [
              - "fe80::18af:36ff:fe36:cf2e",
            ],
          - [
              - "fe80::4cd:94ff:fe6c:807e",
            ],
          - [
              - "fe80::fccf:16ff:fe70:a306",
            ],
          - [
              - "fe80::acd5:e2ff:fefe:eed7",
            ],
          - [
              - "fe80::801:8ff:fe72:119",
            ],
          - [
              - "fe80::dc31:12ff:fe40:5606",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "9E:E5:FB:B7:7C:C6",
          - "DA:6E:21:4F:09:65",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D5:00:A6",
          - "F6:1B:18:6A:BA:A5",
          - "3E:A3:57:E0:2B:EA",
          - "12:4D:C1:CA:A4:61",
          - "82:66:C2:68:5A:B8",
          - "B6:42:5F:61:33:99",
          - "5E:31:28:B2:16:C3",
          - "22:C7:C6:96:1A:6C",
          - "B2:D1:2F:A0:84:28",
          - "EA:44:67:B2:06:45",
          - "42:10:2C:EF:AC:26",
          - "0A:EC:24:AD:CC:5C",
          - "CA:BA:71:65:C0:5B",
          - "B6:5F:FF:50:D2:F0",
          - "1A:AF:36:36:CF:2E",
          - "06:CD:94:6C:80:7E",
          - "FE:CF:16:70:A3:06",
          - "AE:D5:E2:FE:EE:D7",
          - "0A:01:08:72:01:19",
          - "DE:31:12:40:56:06",
        ] -> (known after apply)
        name                    = "talos-controlplane-3"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc39be06e8ee0f",
          - "lxc135219efdb91",
          - "lxc51780e2a167f",
          - "lxc4b2b70ec235d",
          - "lxcf25be10fb502",
          - "lxcedbf7e3a9e4b",
          - "lxcb7c847cd5f95",
          - "lxc6e5ec6c0d96a",
          - "lxcb57d49acd734",
          - "lxcfb2ff22adbc2",
          - "lxcef1d9365c761",
          - "lxc6b5fa7784524",
          - "lxcad9a400d8f31",
          - "lxc1e8cd0fecc63",
          - "lxc908ffcb0861e",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 103 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-103-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D5:00:A6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-1"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "101" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.51",
            ],
          - [],
          - [
              - "10.244.0.237",
            ],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe6f:15b6",
            ],
          - [
              - "fe80::1055:ebff:feec:594",
            ],
          - [
              - "fe80::e058:8bff:feff:13e5",
            ],
          - [
              - "fe80::c492:7fff:fe0e:a864",
            ],
          - [
              - "fe80::7823:8eff:fe1e:cea5",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "AE:48:B1:F2:AD:04",
          - "FE:20:C7:0C:46:D3",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:6F:15:B6",
          - "12:55:EB:EC:05:94",
          - "E2:58:8B:FF:13:E5",
          - "C6:92:7F:0E:A8:64",
          - "7A:23:8E:1E:CE:A5",
        ] -> (known after apply)
        name                    = "talos-worker-1"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 101 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-101-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:6F:15:B6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-2"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "102" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.52",
            ],
          - [],
          - [
              - "10.244.1.28",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe45:f407",
            ],
          - [
              - "fe80::1822:69ff:fe22:32ff",
            ],
          - [
              - "fe80::e0b0:f6ff:fe46:ec03",
            ],
          - [
              - "fe80::d002:4bff:fed8:3651",
            ],
          - [
              - "fe80::9c97:efff:fe46:2552",
            ],
          - [
              - "fe80::34b2:21ff:fed7:bb09",
            ],
          - [
              - "fe80::6cff:55ff:fe3a:b6fa",
            ],
          - [
              - "fe80::d029:c0ff:fed2:8329",
            ],
          - [
              - "fe80::4c2e:65ff:fe70:43c",
            ],
          - [
              - "fe80::2885:30ff:fe65:2cf6",
            ],
          - [
              - "fe80::48e9:fdff:fef1:4750",
            ],
          - [
              - "fe80::f803:ecff:fe04:80a6",
            ],
          - [
              - "fe80::6412:3eff:fef0:66f0",
            ],
          - [
              - "fe80::f8bd:c5ff:feae:a9b4",
            ],
          - [
              - "fe80::a8c8:c5ff:fe02:559e",
            ],
          - [
              - "fe80::83f:6cff:fe63:43ff",
            ],
          - [
              - "fe80::1492:c9ff:fe69:2d3f",
            ],
          - [
              - "fe80::b030:48ff:fefd:58de",
            ],
          - [
              - "fe80::e842:bcff:fe54:e962",
            ],
          - [
              - "fe80::74f5:5aff:fe4a:635b",
            ],
          - [
              - "fe80::2cb2:2cff:fee5:28b6",
            ],
          - [
              - "fe80::5c98:f1ff:fe62:6403",
            ],
          - [
              - "fe80::a402:feff:fe87:936e",
            ],
          - [
              - "fe80::c6e:1fff:fe10:662d",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "5E:ED:12:E1:0E:0C",
          - "42:70:0C:52:B8:AF",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:45:F4:07",
          - "1A:22:69:22:32:FF",
          - "E2:B0:F6:46:EC:03",
          - "D2:02:4B:D8:36:51",
          - "9E:97:EF:46:25:52",
          - "36:B2:21:D7:BB:09",
          - "6E:FF:55:3A:B6:FA",
          - "D2:29:C0:D2:83:29",
          - "4E:2E:65:70:04:3C",
          - "2A:85:30:65:2C:F6",
          - "4A:E9:FD:F1:47:50",
          - "FA:03:EC:04:80:A6",
          - "66:12:3E:F0:66:F0",
          - "FA:BD:C5:AE:A9:B4",
          - "AA:C8:C5:02:55:9E",
          - "0A:3F:6C:63:43:FF",
          - "16:92:C9:69:2D:3F",
          - "B2:30:48:FD:58:DE",
          - "EA:42:BC:54:E9:62",
          - "76:F5:5A:4A:63:5B",
          - "2E:B2:2C:E5:28:B6",
          - "5E:98:F1:62:64:03",
          - "A6:02:FE:87:93:6E",
          - "0E:6E:1F:10:66:2D",
        ] -> (known after apply)
        name                    = "talos-worker-2"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc6de540fe272d",
          - "lxc076797cbec96",
          - "lxce4332b4603b6",
          - "lxc6410402f7cdf",
          - "lxc58727890e1a9",
          - "lxc3a55ad4b002b",
          - "lxc94a641c23937",
          - "lxc286dfc86969e",
          - "lxc716084e042ec",
          - "lxcd3355b6d7824",
          - "lxc4db3699fe660",
          - "lxcb354b4496c92",
          - "lxcfedf17cf986c",
          - "lxc9f99d8290bf5",
          - "lxc168f7e8a4277",
          - "lxce83b47ae8b42",
          - "lxc6c0a8a221a25",
          - "lxc88d067276308",
          - "lxc8d7e2ce36932",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 102 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-102-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:45:F4:07" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 10 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>